[
  {
    "name": "Celena Green",
    "team": "Venture Studio",
    "role": "Entrepreneur",
    "img": "celena-green.jpg",
    "linkedin": "https://www.linkedin.com/in/celenagreen/",
    "bio": "Celena Green is a social entrepreneur and ecosystem builder with over 20 years of experience leading economic growth and inclusive prosperity initiatives in emerging markets. Celena led economic development and leadership programs serving women and youth in the U.S. and in several African countries before founding her own ventures to strengthen mission-driven non-profits and small\/medium enterprises. Celena’s most recent ventures include Teke Global Inc, a social enterprise consultancy, and FoundRE, a property technology startup supporting small businesses and property owners working to revive former industrial communities. A native New Yorker, Celena studied Africana Studies and Economics at Brooklyn College-CUNY and pursued entrepreneurial training with several accelerators and venture studios. Currently residing in South Bend, Indiana, Celena is committed to leveraging the untapped potential of technology and the built environment to create opportunities for inclusive prosperity."
  },
  {
    "name": "Santana Perez",
    "team": "Venture Studio",
    "role": "Entrepreneur",
    "img": "santana-perez.jpg",
    "linkedin": "https://www.linkedin.com/in/santanaperez/",
    "bio": "Santana Perez is a corporate finance professional from Houston, Texas, with over 12 years of experience leading corporate finance strategy, investment analysis, restructuring and bankruptcies, and focused strategy within the power and gas retailer space. In her most recent role, Santana served as a credit manager for EDF Trading, an international commodity trading firm. As a direct beneficiary of the Wells Fargo LIFT program, Santana is passionate about helping others achieve homeownership through down payment assistance programs. Through her venture, Santana hopes to help hundreds of families achieve homeownership by significantly reducing barriers to information, streamlining the down payment assistance process, and helping every home buyer through each step of the process. Santana also aims to increase diversity and inclusion across the board to eliminate the gap in homeownership for communities of color."
  },
  {
    "name": "LaToria Pierce",
    "team": "Venture Studio",
    "role": "Entrepreneur",
    "img": "latoria-pierce.jpg",
    "linkedin": "https://www.linkedin.com/in/latoriapierce/",
    "bio": "LaToria Pierce is an engagement specialist and entrepreneur residing in Fairfax, Virginia. Her professional experience spans across the media, marketing, and fintech areas. LaToria has led social impact initiatives and managed engagement strategies for both local and national non-profits in domestic violence outreach and policy, as well as in financial health for older working adults and families with limited income. Through entrepreneurship in media, LaToria learned the power of dialogue. As a host and producer in community TV and global automotive spokesperson, she discovered that the most effective way to understand how to serve people is to “let people speak and listen to them with the intent to understand.\" Born and raised in Indiana by a single teen mother (who later married a young army soldier), LaToria lived briefly in Germany and grew up in Arizona. LaToria credits her young parents’ ability to overcome life challenges and dedicate their careers to serving vulnerable groups for her shared dedication to making a difference in the lives of others. She attended Arizona State University – W.P. Carey School of Business, majoring in global studies (BS), and furthered her education in media business studies (MS) at Full Sail University in Florida."
  },
  {
    "name": "Kortney Ziegler",
    "team": "Venture Studio",
    "role": "Entrepreneur",
    "img": "kortney-ziegler.jpg",
    "linkedin": "https://www.linkedin.com/in/dr-kortney-ziegler-65885845/",
    "bio": "Dr. Kortney Ziegler is a social entrepreneur from Oakland, California, and the founder of several ventures aimed at addressing the excess costs of poverty within the Black and transgender communities. Ziegler’s last business, Appolition, reduced the costs of incarceration by helping people afford bail so they could return to their families and livelihood. Prior to his journey as a tech entrepreneur, Ziegler obtained a PhD of African American Studies from Northwestern University and spent time teaching in the disciplines of Film Production, Black Studies, and Gender Studies. A self-described problem solver, Ziegler incorporates his scholarly background with his entrepreneurial desires to develop innovative solutions that direct financial resources to vulnerable communities."
  }
]
